apache/nuttx/arch/arm/src/stm32f0/stm32f0_usbdev.c
/****************************************************************************
 * arch/arm/src/stm32f0/stm32f0_usbdev.c
 *
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.orgr>
 *
 * Ported from the STM32 F1 implmentation.  References:
 *   - RM0008 Reference manual, STMicro document ID 13902
 *   - STM32F10xxx USB development kit, UM0424, STMicro
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <nuttx/irq.h>

#include "up_arch.h"
#include "up_internal.h"
#include "chip/stm32f0_rcc.h"
#include "chip/stm32f0_usbdev.h"
#include "stm32f0_hsi48.h"
#include "stm32f0_gpio.h"
#include "stm32f0_usbdev.h"

#if defined(CONFIG_USBDEV) && defined(CONFIG_STM32F0_USB)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#ifndef CONFIG_USBDEV_EP0_MAXSIZE
#  define CONFIG_USBDEV_EP0_MAXSIZE 64
#endif

#ifndef CONFIG_USBDEV_SETUP_MAXDATASIZE
#  define CONFIG_USBDEV_SETUP_MAXDATASIZE CONFIG_USBDEV_EP0_MAXSIZE
#endif

/* Extremely detailed register debug that you would normally never want
 * enabled.
 */

#ifndef CONFIG_DEBUG_USB_INFO
#  undef CONFIG_STM32F0_USBDEV_REGDEBUG
#endif

/* Initial interrupt mask: Reset + Suspend + Correct Transfer */

#define STM32F0_CNTR_SETUP     (USB_CNTR_RESETM|USB_CNTR_SUSPM|USB_CNTR_CTRM)

/* Endpoint identifiers. The STM32 supports up to 16 mono-directional or 8
 * bidirectional endpoints.  However, when you take into account PMA buffer
 * usage (see below) and the fact that EP0 is bidirectional, then there is
 * a functional limitation of EP0 + 5 mono-directional endpoints = 6.  We'll
 * define STM32F0_NENDPOINTS to be 8, however, because that is how many
 * endpoint register sets there are.
 */

#define STM32F0_NENDPOINTS      (8)
#define EP0                   (0)
#define EP1                   (1)
#define EP2                   (2)
#define EP3                   (3)
#define EP4                   (4)
#define EP5                   (5)
#define EP6                   (6)
#define EP7                   (7)

#define STM32F0_ENDP_BIT(ep)    (1 << (ep))
#define STM32F0_ENDP_ALLSET     0xff

/* Packet sizes.  We us a fixed 64 max packet size for all endpoint types */

#define STM32F0_MAXPACKET_SHIFT (6)
#define STM32F0_MAXPACKET_SIZE  (1 << (STM32F0_MAXPACKET_SHIFT))
#define STM32F0_MAXPACKET_MASK  (STM32F0_MAXPACKET_SIZE-1)

#define STM32F0_EP0MAXPACKET    STM32F0_MAXPACKET_SIZE

/* Buffer descriptor table.  We assume that USB has exclusive use of CAN/USB
 * memory.  The buffer table is positioned at the beginning of the 512-byte
 * CAN/USB memory.  We will use the first STM32F0_NENDPOINTS*4 words for the buffer
 * table.  That is exactly 64 bytes, leaving 7*64 bytes for endpoint buffers.
 */

#define STM32F0_BTABLE_ADDRESS  (0x00)   /* Start at the beginning of USB/CAN RAM */
#define STM32F0_DESC_SIZE       (8)      /* Each descriptor is 4*2=8 bytes in size */
#define STM32F0_BTABLE_SIZE     (STM32F0_NENDPOINTS*STM32F0_DESC_SIZE)

/* Buffer layout.  Assume that all buffers are 64-bytes (maxpacketsize), then
 * we have space for only 7 buffers; endpoint 0 will require two buffers, leaving
 * 5 for other endpoints.
 */

#define STM32F0_BUFFER_START    STM32F0_BTABLE_SIZE
#define STM32F0_EP0_RXADDR      STM32F0_BUFFER_START
#define STM32F0_EP0_TXADDR      (STM32F0_EP0_RXADDR+STM32F0_EP0MAXPACKET)

#define STM32F0_BUFFER_EP0      0x03
#define STM32F0_NBUFFERS        7
#define STM32F0_BUFFER_BIT(bn)  (1 << (bn))
#define STM32F0_BUFFER_ALLSET   0x7f
#define STM32F0_BUFNO2BUF(bn)   (STM32F0_BUFFER_START+((bn)<<STM32F0_MAXPACKET_SHIFT))

/* USB-related masks */

#define REQRECIPIENT_MASK     (USB_REQ_TYPE_MASK | USB_REQ_RECIPIENT_MASK)

/* Endpoint register masks (handling toggle fields) */

#define EPR_NOTOG_MASK        (USB_EPR_CTR_RX  | USB_EPR_SETUP  | USB_EPR_EPTYPE_MASK |\
                               USB_EPR_EP_KIND | USB_EPR_CTR_TX | USB_EPR_EA_MASK)
#define EPR_TXDTOG_MASK       (USB_EPR_STATTX_MASK | EPR_NOTOG_MASK)
#define EPR_RXDTOG_MASK       (USB_EPR_STATRX_MASK | EPR_NOTOG_MASK)

/* Request queue operations *************************************************/

#define stm32f0_rqempty(ep)     ((ep)->head == NULL)
#define stm32f0_rqpeek(ep)      ((ep)->head)

/* USB trace ****************************************************************/
/* Trace error codes */

#define STM32F0_TRACEERR_ALLOCFAIL            0x0001
#define STM32F0_TRACEERR_BADCLEARFEATURE      0x0002
#define STM32F0_TRACEERR_BADDEVGETSTATUS      0x0003
#define STM32F0_TRACEERR_BADEPGETSTATUS       0x0004
#define STM32F0_TRACEERR_BADEPNO              0x0005
#define STM32F0_TRACEERR_BADEPTYPE            0x0006
#define STM32F0_TRACEERR_BADGETCONFIG         0x0007
#define STM32F0_TRACEERR_BADGETSETDESC        0x0008
#define STM32F0_TRACEERR_BADGETSTATUS         0x0009
#define STM32F0_TRACEERR_BADSETADDRESS        0x000a
#define STM32F0_TRACEERR_BADSETCONFIG         0x000b
#define STM32F0_TRACEERR_BADSETFEATURE        0x000c
#define STM32F0_TRACEERR_BINDFAILED           0x000d
#define STM32F0_TRACEERR_DISPATCHSTALL        0x000e
#define STM32F0_TRACEERR_DRIVER               0x000f
#define STM32F0_TRACEERR_DRIVERREGISTERED     0x0010
#define STM32F0_TRACEERR_EP0BADCTR            0x0011
#define STM32F0_TRACEERR_EP0SETUPSTALLED      0x0012
#define STM32F0_TRACEERR_EPBUFFER             0x0013
#define STM32F0_TRACEERR_EPDISABLED           0x0014
#define STM32F0_TRACEERR_EPOUTNULLPACKET      0x0015
#define STM32F0_TRACEERR_EPRESERVE            0x0016
#define STM32F0_TRACEERR_INVALIDCTRLREQ       0x0017
#define STM32F0_TRACEERR_INVALIDPARMS         0x0018
#define STM32F0_TRACEERR_IRQREGISTRATION      0x0019
#define STM32F0_TRACEERR_NOTCONFIGURED        0x001a
#define STM32F0_TRACEERR_REQABORTED           0x001b

/* Trace interrupt codes */

#define STM32F0_TRACEINTID_CLEARFEATURE       0x0001
#define STM32F0_TRACEINTID_DEVGETSTATUS       0x0002
#define STM32F0_TRACEINTID_DISPATCH           0x0003
#define STM32F0_TRACEINTID_EP0IN              0x0004
#define STM32F0_TRACEINTID_EP0INDONE          0x0005
#define STM32F0_TRACEINTID_EP0OUTDONE         0x0006
#define STM32F0_TRACEINTID_EP0SETUPDONE       0x0007
#define STM32F0_TRACEINTID_EP0SETUPSETADDRESS 0x0008
#define STM32F0_TRACEINTID_EPGETSTATUS        0x0009
#define STM32F0_TRACEINTID_EPINDONE           0x000a
#define STM32F0_TRACEINTID_EPINQEMPTY         0x000b
#define STM32F0_TRACEINTID_EPOUTDONE          0x000c
#define STM32F0_TRACEINTID_EPOUTPENDING       0x000d
#define STM32F0_TRACEINTID_EPOUTQEMPTY        0x000e
#define STM32F0_TRACEINTID_ESOF               0x000f
#define STM32F0_TRACEINTID_GETCONFIG          0x0010
#define STM32F0_TRACEINTID_GETSETDESC         0x0011
#define STM32F0_TRACEINTID_GETSETIF           0x0012
#define STM32F0_TRACEINTID_GETSTATUS          0x0013
#define STM32F0_TRACEINTID_INTERRUPT          0x0014
#define STM32F0_TRACEINTID_IFGETSTATUS        0x0015
#define STM32F0_TRACEINTID_LPCTR              0x0016
#define STM32F0_TRACEINTID_NOSTDREQ           0x0017
#define STM32F0_TRACEINTID_RESET              0x0018
#define STM32F0_TRACEINTID_SETCONFIG          0x0019
#define STM32F0_TRACEINTID_SETFEATURE         0x001a
#define STM32F0_TRACEINTID_SUSP               0x001b
#define STM32F0_TRACEINTID_SYNCHFRAME         0x001c
#define STM32F0_TRACEINTID_WKUP               0x001d
#define STM32F0_TRACEINTID_EP0SETUPOUT        0x001e
#define STM32F0_TRACEINTID_EP0SETUPOUTDATA    0x001f

/* Ever-present MIN and MAX macros */

#ifndef MIN
#  define MIN(a,b) (a < b ? a : b)
#endif

#ifndef MAX
#  define MAX(a,b) (a > b ? a : b)
#endif

