apache/nuttx/arch/arm/src/stm32f0/stm32f0_usbdev.c
  regval  = stm32f0_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_EA_MASK;
  regval |= (addr << USB_EPR_EA_SHIFT);
  stm32f0_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32f0_seteptype
 ****************************************************************************/

static inline void stm32f0_seteptype(uint8_t epno, uint16_t type)
{
  uint32_t epaddr = STM32F0_USB_EPR(epno);
  uint16_t regval;

  regval  = stm32f0_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_EPTYPE_MASK;
  regval |= type;
  stm32f0_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32f0_setstatusout
 ****************************************************************************/

static inline void stm32f0_setstatusout(uint8_t epno)
{
  uint32_t epaddr = STM32F0_USB_EPR(epno);
  uint16_t regval;

  /* For a BULK endpoint the EP_KIND bit is used to enabled double buffering;
   * for a CONTROL endpoint, it is set to indicate that a status OUT
   * transaction is expected.  The bit is not used with out endpoint types.
   */

  regval  = stm32f0_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval |= USB_EPR_EP_KIND;
  stm32f0_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32f0_clrstatusout
 ****************************************************************************/

static inline void stm32f0_clrstatusout(uint8_t epno)
{
  uint32_t epaddr = STM32F0_USB_EPR(epno);
  uint16_t regval;

  /* For a BULK endpoint the EP_KIND bit is used to enabled double buffering;
   * for a CONTROL endpoint, it is set to indicate that a status OUT
   * transaction is expected.  The bit is not used with out endpoint types.
   */

  regval  = stm32f0_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_EP_KIND;
  stm32f0_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32f0_clrrxdtog
 ****************************************************************************/

static void stm32f0_clrrxdtog(uint8_t epno)
{
  uint32_t epaddr = STM32F0_USB_EPR(epno);
  uint16_t regval;

  regval = stm32f0_getreg(epaddr);
  if ((regval & USB_EPR_DTOG_RX) != 0)
    {
      regval &= EPR_NOTOG_MASK;
      regval |= USB_EPR_DTOG_RX;
      stm32f0_putreg(regval, epaddr);
    }
}

/****************************************************************************
 * Name: stm32f0_clrtxdtog
 ****************************************************************************/

static void stm32f0_clrtxdtog(uint8_t epno)
{
  uint32_t epaddr = STM32F0_USB_EPR(epno);
  uint16_t regval;

  regval = stm32f0_getreg(epaddr);
  if ((regval & USB_EPR_DTOG_TX) != 0)
    {
      regval &= EPR_NOTOG_MASK;
      regval |= USB_EPR_DTOG_TX;
      stm32f0_putreg(regval, epaddr);
    }
}

/****************************************************************************
 * Name: stm32f0_clrepctrrx
 ****************************************************************************/

static void stm32f0_clrepctrrx(uint8_t epno)
{
  uint32_t epaddr = STM32F0_USB_EPR(epno);
  uint16_t regval;

  regval  = stm32f0_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_CTR_RX;
  stm32f0_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32f0_clrepctrtx
 ****************************************************************************/

static void stm32f0_clrepctrtx(uint8_t epno)
{
  uint32_t epaddr = STM32F0_USB_EPR(epno);
  uint16_t regval;

  regval  = stm32f0_getreg(epaddr);
  regval &= EPR_NOTOG_MASK;
  regval &= ~USB_EPR_CTR_TX;
  stm32f0_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32f0_geteptxstatus
 ****************************************************************************/

static inline uint16_t stm32f0_geteptxstatus(uint8_t epno)
{
  return (uint16_t)(stm32f0_getreg(STM32F0_USB_EPR(epno)) & USB_EPR_STATTX_MASK);
}

/****************************************************************************
 * Name: stm32f0_geteprxstatus
 ****************************************************************************/

static inline uint16_t stm32f0_geteprxstatus(uint8_t epno)
{
  return (stm32f0_getreg(STM32F0_USB_EPR(epno)) & USB_EPR_STATRX_MASK);
}

/****************************************************************************
 * Name: stm32f0_seteptxstatus
 ****************************************************************************/

static void stm32f0_seteptxstatus(uint8_t epno, uint16_t state)
{
  uint32_t epaddr = STM32F0_USB_EPR(epno);
  uint16_t regval;

  /* The bits in the STAT_TX field can be toggled by software to set their
   * value. When set to 0, the value remains unchanged; when set to one,
   * value toggles.
   */

  regval = stm32f0_getreg(epaddr);

  /* The exclusive OR will set STAT_TX bits to 1 if there value is different
   * from the bits requested in 'state'
   */

  regval ^= state;
  regval &= EPR_TXDTOG_MASK;
  stm32f0_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32f0_seteprxstatus
 ****************************************************************************/

static void stm32f0_seteprxstatus(uint8_t epno, uint16_t state)
{
  uint32_t epaddr = STM32F0_USB_EPR(epno);
  uint16_t regval;

  /* The bits in the STAT_RX field can be toggled by software to set their
   * value. When set to 0, the value remains unchanged; when set to one,
   * value toggles.
   */

  regval = stm32f0_getreg(epaddr);

  /* The exclusive OR will set STAT_RX bits to 1 if there value is different
   * from the bits requested in 'state'
   */

  regval ^= state;
  regval &= EPR_RXDTOG_MASK;
  stm32f0_putreg(regval, epaddr);
}

/****************************************************************************
 * Name: stm32f0_eptxstalled
 ****************************************************************************/

static inline bool stm32f0_eptxstalled(uint8_t epno)
{
  return (stm32f0_geteptxstatus(epno) == USB_EPR_STATTX_STALL);
}

/****************************************************************************
 * Name: stm32f0_eprxstalled
 ****************************************************************************/

static inline bool stm32f0_eprxstalled(uint8_t epno)
{
  return (stm32f0_geteprxstatus(epno) == USB_EPR_STATRX_STALL);
}

/****************************************************************************
 * Request Helpers
 ****************************************************************************/
/****************************************************************************
 * Name: stm32f0_copytopma
 ****************************************************************************/

static void stm32f0_copytopma(const uint8_t *buffer, uint16_t pma, uint16_t nbytes)
{
  uint16_t *dest;
  uint16_t  ms;
  uint16_t  ls;
  int     nwords = (nbytes + 1) >> 1;
  int     i;

  /* Copy loop.  Source=user buffer, Dest=packet memory */

  dest = (uint16_t *)(STM32F0_USBRAM_BASE + ((uint32_t)pma << 1));
  for (i = nwords; i != 0; i--)
    {
      /* Read two bytes and pack into on 16-bit word */

      ls = (uint16_t)(*buffer++);
      ms = (uint16_t)(*buffer++);
      *dest = ms << 8 | ls;

      /* Source address increments by 2*sizeof(uint8_t) = 2; Dest address
       * increments by 2*sizeof(uint16_t) = 4.
       */

      dest += 2;
    }
}

/****************************************************************************
 * Name: stm32f0_copyfrompma
 ****************************************************************************/

static inline void
stm32f0_copyfrompma(uint8_t *buffer, uint16_t pma, uint16_t nbytes)
{
  uint32_t *src;
  int     nwords = (nbytes + 1) >> 1;
  int     i;

