apache/nuttx/arch/arm/src/stm32f0/stm32f0_usbdev.c
  priv->rxstatus = USB_EPR_STATRX_NAK;
  priv->txstatus = USB_EPR_STATTX_NAK;

  /* Set both RX and TX status to NAK  */

  stm32f0_seteprxstatus(EP0, USB_EPR_STATRX_NAK);
  stm32f0_seteptxstatus(EP0, USB_EPR_STATTX_NAK);

  /* Check the direction bit to determine if this the completion of an EP0
   * packet sent to or received from the host PC.
   */

  if ((istr & USB_ISTR_DIR) == 0)
    {
      /* EP0 IN: device-to-host (DIR=0) */

      usbtrace(TRACE_INTDECODE(STM32F0_TRACEINTID_EP0IN), istr);
      stm32f0_clrepctrtx(EP0);
      stm32f0_ep0in(priv);
    }
  else
    {
      /* EP0 OUT: host-to-device (DIR=1) */

      epr = stm32f0_getreg(STM32F0_USB_EPR(EP0));

      /* CTR_TX is set when an IN transaction successfully
       * completes on an endpoint
       */

      if ((epr & USB_EPR_CTR_TX) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32F0_TRACEINTID_EP0INDONE), epr);
          stm32f0_clrepctrtx(EP0);
          stm32f0_ep0in(priv);
        }

      /* SETUP is set by the hardware when the last completed
       * transaction was a control endpoint SETUP
       */

      else if ((epr & USB_EPR_SETUP) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32F0_TRACEINTID_EP0SETUPDONE), epr);
          stm32f0_clrepctrrx(EP0);
          stm32f0_ep0setup(priv);
        }

      /* Set by the hardware when an OUT/SETUP transaction successfully
       * completed on this endpoint.
       */

      else if ((epr & USB_EPR_CTR_RX) != 0)
        {
          usbtrace(TRACE_INTDECODE(STM32F0_TRACEINTID_EP0OUTDONE), epr);
          stm32f0_clrepctrrx(EP0);
          stm32f0_ep0out(priv);
        }

      /* None of the above */

      else
        {
          usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_EP0BADCTR), epr);
          return; /* Does this ever happen? */
        }
    }

  /* Make sure that the EP0 packet size is still OK (superstitious?) */

  stm32f0_seteprxcount(EP0, STM32F0_EP0MAXPACKET);

  /* Now figure out the new RX/TX status.  Here are all possible
   * consequences of the above EP0 operations:
   *
   * rxstatus txstatus ep0state  MEANING
   * -------- -------- --------- ---------------------------------
   * NAK      NAK      IDLE      Nothing happened
   * NAK      VALID    IDLE      EP0 response sent from USBDEV driver
   * NAK      VALID    WRREQUEST EP0 response sent from class driver
   * NAK      ---      STALL     Some protocol error occurred
   *
   * First handle the STALL condition:
   */

  if (priv->ep0state == EP0STATE_STALLED)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_EP0SETUPSTALLED), priv->ep0state);
      priv->rxstatus = USB_EPR_STATRX_STALL;
      priv->txstatus = USB_EPR_STATTX_STALL;
    }

  /* Was a transmission started?  If so, txstatus will be VALID.  The
   * only special case to handle is when both are set to NAK.  In that
   * case, we need to set RX status to VALID in order to accept the next
   * SETUP request.
   */

  else if (priv->rxstatus == USB_EPR_STATRX_NAK &&
           priv->txstatus == USB_EPR_STATTX_NAK)
    {
      priv->rxstatus = USB_EPR_STATRX_VALID;
    }

  /* Now set the new TX and RX status */

  stm32f0_seteprxstatus(EP0, priv->rxstatus);
  stm32f0_seteptxstatus(EP0, priv->txstatus);
}

/****************************************************************************
 * Name: stm32f0_lptransfer
 ****************************************************************************/

static void stm32f0_lptransfer(struct stm32f0_usbdev_s *priv)
{
  uint8_t  epno;
  uint16_t istr;

  /* Stay in loop while LP interrupts are pending */

  while (((istr = stm32f0_getreg(STM32F0_USB_ISTR)) & USB_ISTR_CTR) != 0)
    {
      stm32f0_putreg((uint16_t)~USB_ISTR_CTR, STM32F0_USB_ISTR);

      /* Extract highest priority endpoint number */

      epno = (uint8_t)(istr & USB_ISTR_EPID_MASK);

      /* Handle EP0 completion events */

      if (epno == 0)
        {
          stm32f0_ep0done(priv, istr);
        }

      /* Handle other endpoint completion events */

      else
        {
          stm32f0_epdone(priv, epno);
        }
    }
}

/****************************************************************************
 * Name: stm32f0_usb_interrupt
 ****************************************************************************/

static int stm32f0_usb_interrupt(int irq, void *context, FAR void *arg)
{
  struct stm32f0_usbdev_s *priv = (struct stm32f0_usbdev_s *)arg;
  uint16_t istr;
  uint8_t  epno;

  DEBUGASSERT(priv != NULL);

  /* High priority interrupts are only triggered by a correct transfer event
   * for isochronous and double-buffer bulk transfers.
   */

  istr = stm32f0_getreg(STM32F0_USB_ISTR);
  usbtrace(TRACE_INTENTRY(STM32F0_TRACEINTID_INTERRUPT), istr);
  while ((istr & USB_ISTR_CTR) != 0)
    {
      stm32f0_putreg((uint16_t)~USB_ISTR_CTR, STM32F0_USB_ISTR);

      /* Extract highest priority endpoint number */

      epno = (uint8_t)(istr & USB_ISTR_EPID_MASK);

      /* And handle the completion event */

      stm32f0_epdone(priv, epno);

      /* Fetch the status again for the next time through the loop */

      istr = stm32f0_getreg(STM32F0_USB_ISTR);
    }

  /* Handle Reset interrupts.  When this event occurs, the peripheral is left
   * in the same conditions it is left by the system reset (but with the
   * USB controller enabled).
   */

  if ((istr & USB_ISTR_RESET) != 0)
    {
      /* Reset interrupt received. Clear the RESET interrupt status. */

      stm32f0_putreg(~USB_ISTR_RESET, STM32F0_USB_ISTR);
      usbtrace(TRACE_INTDECODE(STM32F0_TRACEINTID_RESET), istr);

      /* Restore our power-up state and exit now because istr is no longer
       * valid.
       */

      stm32f0_reset(priv);
      goto exit_interrupt;
    }

  /* Handle Wakeup interrupts.  This interrupt is only enable while the USB is
   * suspended.
   */

  if ((istr & USB_ISTR_WKUP & priv->imask) != 0)
    {
      /* Wakeup interrupt received. Clear the WKUP interrupt status.  The
       * cause of the resume is indicated in the FNR register
       */

      stm32f0_putreg(~USB_ISTR_WKUP, STM32F0_USB_ISTR);
      usbtrace(TRACE_INTDECODE(STM32F0_TRACEINTID_WKUP), stm32f0_getreg(STM32F0_USB_FNR));

      /* Perform the wakeup action */

      stm32f0_initresume(priv);
      priv->rsmstate = RSMSTATE_IDLE;

      /* Disable ESOF polling, disable the wakeup interrupt, and
       * re-enable the suspend interrupt.  Clear any pending SUSP
       * interrupts.
       */

      stm32f0_setimask(priv, USB_CNTR_SUSPM, USB_CNTR_ESOFM | USB_CNTR_WKUPM);
      stm32f0_putreg(~USB_CNTR_SUSPM, STM32F0_USB_ISTR);
    }

  if ((istr & USB_ISTR_SUSP & priv->imask) != 0)
    {
        usbtrace(TRACE_INTDECODE(STM32F0_TRACEINTID_SUSP), 0);
        stm32f0_suspend(priv);

