apache/nuttx/arch/arm/src/stm32f0/stm32f0_usbdev.c
        /* Clear of the ISTR bit must be done after setting of USB_CNTR_FSUSP */

        stm32f0_putreg(~USB_ISTR_SUSP, STM32F0_USB_ISTR);
    }

  if ((istr & USB_ISTR_ESOF & priv->imask) != 0)
    {
      stm32f0_putreg(~USB_ISTR_ESOF, STM32F0_USB_ISTR);

      /* Resume handling timing is made with ESOFs */

      usbtrace(TRACE_INTDECODE(STM32F0_TRACEINTID_ESOF), 0);
      stm32f0_esofpoll(priv);
    }

  if ((istr & USB_ISTR_CTR & priv->imask) != 0)
    {
      /* Low priority endpoint correct transfer interrupt */

      usbtrace(TRACE_INTDECODE(STM32F0_TRACEINTID_LPCTR), istr);
      stm32f0_lptransfer(priv);
    }

exit_interrupt:
  usbtrace(TRACE_INTEXIT(STM32F0_TRACEINTID_INTERRUPT), 0);
  return OK;
}

/****************************************************************************
 * Name: stm32f0_setimask
 ****************************************************************************/

static void
stm32f0_setimask(struct stm32f0_usbdev_s *priv, uint16_t setbits, uint16_t clrbits)
{
  uint16_t regval;

  /* Adjust the interrupt mask bits in the shadow copy first */

  priv->imask &= ~clrbits;
  priv->imask |= setbits;

  /* Then make the interrupt mask bits in the CNTR register match the shadow
   * register (Hmmm... who is shadowing whom?)
   */

  regval  = stm32f0_getreg(STM32F0_USB_CNTR);
  regval &= ~USB_CNTR_ALLINTS;
  regval |= priv->imask;
  stm32f0_putreg(regval, STM32F0_USB_CNTR);
}

/****************************************************************************
 * Suspend/Resume Helpers
 ****************************************************************************/
/****************************************************************************
 * Name: stm32f0_suspend
 ****************************************************************************/

static void stm32f0_suspend(struct stm32f0_usbdev_s *priv)
{
  uint16_t regval;

  /* Notify the class driver of the suspend event */

  if (priv->driver)
    {
      CLASS_SUSPEND(priv->driver, &priv->usbdev);
    }

  /* Disable ESOF polling, disable the SUSP interrupt, and enable the WKUP
   * interrupt.  Clear any pending WKUP interrupt.
   */

  stm32f0_setimask(priv, USB_CNTR_WKUPM, USB_CNTR_ESOFM | USB_CNTR_SUSPM);
  stm32f0_putreg(~USB_ISTR_WKUP, STM32F0_USB_ISTR);

  /* Set the FSUSP bit in the CNTR register.  This activates suspend mode
   * within the USB peripheral and disables further SUSP interrupts.
   */

  regval  = stm32f0_getreg(STM32F0_USB_CNTR);
  regval |= USB_CNTR_FSUSP;
  stm32f0_putreg(regval, STM32F0_USB_CNTR);

  /* If we are not a self-powered device, the got to low-power mode */

  if (!priv->selfpowered)
    {
      /* Setting LPMODE in the CNTR register removes static power
       * consumption in the USB analog transceivers but keeps them
       * able to detect resume activity
       */

      regval = stm32f0_getreg(STM32F0_USB_CNTR);
      regval |= USB_CNTR_LPMODE;
      stm32f0_putreg(regval, STM32F0_USB_CNTR);
    }

  /* Let the board-specific logic know that we have entered the suspend
   * state
   */

  stm32f0_usbsuspend((struct usbdev_s *)priv, false);
}

/****************************************************************************
 * Name: stm32f0_initresume
 ****************************************************************************/

static void stm32f0_initresume(struct stm32f0_usbdev_s *priv)
{
  uint16_t regval;

  /* This function is called when either (1) a WKUP interrupt is received from
   * the host PC, or (2) the class device implementation calls the wakeup()
   * method.
   */

  /* Clear the USB low power mode (lower power mode was not set if this is
   * a self-powered device.  Also, low power mode is automatically cleared by
   * hardware when a WKUP interrupt event occurs).
   */

  regval = stm32f0_getreg(STM32F0_USB_CNTR);
  regval &= (~USB_CNTR_LPMODE);
  stm32f0_putreg(regval, STM32F0_USB_CNTR);

  /* Restore full power -- whatever that means for this particular board */

  stm32f0_usbsuspend((struct usbdev_s *)priv, true);

  /* Reset FSUSP bit and enable normal interrupt handling */

  stm32f0_putreg(STM32F0_CNTR_SETUP, STM32F0_USB_CNTR);

  /* Notify the class driver of the resume event */

  if (priv->driver)
    {
      CLASS_RESUME(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: stm32f0_esofpoll
 ****************************************************************************/

static void stm32f0_esofpoll(struct stm32f0_usbdev_s *priv)
{
  uint16_t regval;

    /* Called periodically from ESOF interrupt after RSMSTATE_STARTED */

  switch (priv->rsmstate)
    {
    /* One ESOF after internal resume requested */

    case RSMSTATE_STARTED:
      regval         = stm32f0_getreg(STM32F0_USB_CNTR);
      regval        |= USB_CNTR_RESUME;
      stm32f0_putreg(regval, STM32F0_USB_CNTR);
      priv->rsmstate = RSMSTATE_WAITING;
      priv->nesofs   = 10;
      break;

    /* Countdown before completing the operation */

    case RSMSTATE_WAITING:
      priv->nesofs--;
      if (priv->nesofs == 0)
        {
          /* Okay.. we are ready to resume normal operation */

          regval         = stm32f0_getreg(STM32F0_USB_CNTR);
          regval        &= (~USB_CNTR_RESUME);
          stm32f0_putreg(regval, STM32F0_USB_CNTR);
          priv->rsmstate = RSMSTATE_IDLE;

          /* Disable ESOF polling, disable the SUSP interrupt, and enable
           * the WKUP interrupt.  Clear any pending WKUP interrupt.
           */

          stm32f0_setimask(priv, USB_CNTR_WKUPM, USB_CNTR_ESOFM | USB_CNTR_SUSPM);
          stm32f0_putreg(~USB_ISTR_WKUP, STM32F0_USB_ISTR);
        }
      break;

    case RSMSTATE_IDLE:
    default:
      priv->rsmstate = RSMSTATE_IDLE;
      break;
    }
}

/****************************************************************************
 * Endpoint Helpers
 ****************************************************************************/
/****************************************************************************
 * Name: stm32f0_epreserve
 ****************************************************************************/

static inline struct stm32f0_ep_s *
stm32f0_epreserve(struct stm32f0_usbdev_s *priv, uint8_t epset)
{
  struct stm32f0_ep_s *privep = NULL;
  irqstate_t flags;
  int epndx = 0;

  flags = enter_critical_section();
  epset &= priv->epavail;
  if (epset)
    {
      /* Select the lowest bit in the set of matching, available endpoints
       * (skipping EP0)
       */

      for (epndx = 1; epndx < STM32F0_NENDPOINTS; epndx++)
        {
          uint8_t bit = STM32F0_ENDP_BIT(epndx);
          if ((epset & bit) != 0)
            {
              /* Mark the endpoint no longer available */

              priv->epavail &= ~bit;

              /* And return the pointer to the standard endpoint structure */

