apache/nuttx/arch/arm/src/stm32f0/stm32f0_usbdev.c
              privep = &priv->eplist[epndx];
              break;
            }
        }
    }

  leave_critical_section(flags);
  return privep;
}

/****************************************************************************
 * Name: stm32f0_epunreserve
 ****************************************************************************/

static inline void
stm32f0_epunreserve(struct stm32f0_usbdev_s *priv, struct stm32f0_ep_s *privep)
{
  irqstate_t flags = enter_critical_section();
  priv->epavail   |= STM32F0_ENDP_BIT(USB_EPNO(privep->ep.eplog));
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: stm32f0_epreserved
 ****************************************************************************/

static inline bool
stm32f0_epreserved(struct stm32f0_usbdev_s *priv, int epno)
{
  return ((priv->epavail & STM32F0_ENDP_BIT(epno)) == 0);
}

/****************************************************************************
 * Name: stm32f0_epallocpma
 ****************************************************************************/

static int stm32f0_epallocpma(struct stm32f0_usbdev_s *priv)
{
  irqstate_t flags;
  int bufno = ERROR;
  int bufndx;

  flags = enter_critical_section();
  for (bufndx = 2; bufndx < STM32F0_NBUFFERS; bufndx++)
    {
      /* Check if this buffer is available */

      uint8_t bit = STM32F0_BUFFER_BIT(bufndx);
      if ((priv->bufavail & bit) != 0)
        {
          /* Yes.. Mark the endpoint no longer available */

          priv->bufavail &= ~bit;

          /* And return the index of the allocated buffer */

          bufno = bufndx;
          break;
        }
    }

  leave_critical_section(flags);
  return bufno;
}

/****************************************************************************
 * Name: stm32f0_epfreepma
 ****************************************************************************/

static inline void
stm32f0_epfreepma(struct stm32f0_usbdev_s *priv, struct stm32f0_ep_s *privep)
{
  irqstate_t flags = enter_critical_section();
  priv->epavail   |= STM32F0_ENDP_BIT(privep->bufno);
  leave_critical_section(flags);
}

/****************************************************************************
 * Endpoint operations
 ****************************************************************************/
/****************************************************************************
 * Name: stm32f0_epconfigure
 ****************************************************************************/

static int stm32f0_epconfigure(struct usbdev_ep_s *ep,
                             const struct usb_epdesc_s *desc,
                             bool last)
{
  struct stm32f0_ep_s *privep = (struct stm32f0_ep_s *)ep;
  uint16_t pma;
  uint16_t setting;
  uint16_t maxpacket;
  uint8_t  epno;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !desc)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_INVALIDPARMS), 0);
      uerr("ERROR: ep=%p desc=%p\n");
      return -EINVAL;
    }
#endif

  /* Get the unadorned endpoint address */

  epno = USB_EPNO(desc->addr);
  usbtrace(TRACE_EPCONFIGURE, (uint16_t)epno);
  DEBUGASSERT(epno == USB_EPNO(ep->eplog));

  /* Set the requested type */

  switch (desc->attr & USB_EP_ATTR_XFERTYPE_MASK)
   {
    case USB_EP_ATTR_XFER_INT: /* Interrupt endpoint */
      setting = USB_EPR_EPTYPE_INTERRUPT;
      break;

    case USB_EP_ATTR_XFER_BULK: /* Bulk endpoint */
      setting = USB_EPR_EPTYPE_BULK;
      break;

    case USB_EP_ATTR_XFER_ISOC: /* Isochronous endpoint */
#warning "REVISIT: Need to review isochronous EP setup"
      setting = USB_EPR_EPTYPE_ISOC;
      break;

    case USB_EP_ATTR_XFER_CONTROL: /* Control endpoint */
      setting = USB_EPR_EPTYPE_CONTROL;
      break;

    default:
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_BADEPTYPE), (uint16_t)desc->type);
      return -EINVAL;
    }

  stm32f0_seteptype(epno, setting);

  /* Get the address of the PMA buffer allocated for this endpoint */

#warning "REVISIT: Should configure BULK EPs using double buffer feature"
  pma = STM32F0_BUFNO2BUF(privep->bufno);

  /* Get the maxpacket size of the endpoint. */

  maxpacket = GETUINT16(desc->mxpacketsize);
  DEBUGASSERT(maxpacket <= STM32F0_MAXPACKET_SIZE);
  ep->maxpacket = maxpacket;

  /* Get the subset matching the requested direction */

  if (USB_ISEPIN(desc->addr))
    {
      /* The full, logical EP number includes direction */

      ep->eplog = USB_EPIN(epno);

      /* Set up TX; disable RX */

      stm32f0_seteptxaddr(epno, pma);
      stm32f0_seteptxstatus(epno, USB_EPR_STATTX_NAK);
      stm32f0_seteprxstatus(epno, USB_EPR_STATRX_DIS);
    }
  else
    {
      /* The full, logical EP number includes direction */

      ep->eplog = USB_EPOUT(epno);

      /* Set up RX; disable TX */

      stm32f0_seteprxaddr(epno, pma);
      stm32f0_seteprxcount(epno, maxpacket);
      stm32f0_seteprxstatus(epno, USB_EPR_STATRX_VALID);
      stm32f0_seteptxstatus(epno, USB_EPR_STATTX_DIS);
    }

   stm32f0_dumpep(epno);
   return OK;
}

/****************************************************************************
 * Name: stm32f0_epdisable
 ****************************************************************************/

static int stm32f0_epdisable(struct usbdev_ep_s *ep)
{
  struct stm32f0_ep_s *privep = (struct stm32f0_ep_s *)ep;
  irqstate_t flags;
  uint8_t epno;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_INVALIDPARMS), 0);
      uerr("ERROR: ep=%p\n", ep);
      return -EINVAL;
    }
#endif

  epno = USB_EPNO(ep->eplog);
  usbtrace(TRACE_EPDISABLE, epno);

  /* Cancel any ongoing activity */

  flags = enter_critical_section();
  stm32f0_cancelrequests(privep);

  /* Disable TX; disable RX */

  stm32f0_seteprxcount(epno, 0);
  stm32f0_seteprxstatus(epno, USB_EPR_STATRX_DIS);
  stm32f0_seteptxstatus(epno, USB_EPR_STATTX_DIS);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: stm32f0_epallocreq
 ****************************************************************************/

static struct usbdev_req_s *stm32f0_epallocreq(struct usbdev_ep_s *ep)
{
  struct stm32f0_req_s *privreq;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }
#endif
  usbtrace(TRACE_EPALLOCREQ, USB_EPNO(ep->eplog));

  privreq = (struct stm32f0_req_s *)kmm_malloc(sizeof(struct stm32f0_req_s));
  if (!privreq)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_ALLOCFAIL), 0);
      return NULL;
    }

  memset(privreq, 0, sizeof(struct stm32f0_req_s));
  return &privreq->req;
}

/****************************************************************************
 * Name: stm32f0_epfreereq
 ****************************************************************************/

static void stm32f0_epfreereq(struct usbdev_ep_s *ep, struct usbdev_req_s *req)
{
  struct stm32f0_req_s *privreq = (struct stm32f0_req_s *)req;

#ifdef CONFIG_DEBUG_FEATURES
  if (!ep || !req)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_INVALIDPARMS), 0);
      return;
    }
#endif
  usbtrace(TRACE_EPFREEREQ, USB_EPNO(ep->eplog));

