apache/nuttx/arch/arm/src/stm32f0/stm32f0_usbdev.c
          priv->txstatus = USB_EPR_STATTX_STALL;
          stm32f0_seteptxstatus(epno, USB_EPR_STATTX_STALL);
        }
      else
        {
          /* OUT endpoint */

          priv->rxstatus = USB_EPR_STATRX_STALL;
          stm32f0_seteprxstatus(epno, USB_EPR_STATRX_STALL);
        }
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Device Controller Operations
 ****************************************************************************/
/****************************************************************************
 * Name: stm32f0_allocep
 ****************************************************************************/

static struct usbdev_ep_s *stm32f0_allocep(struct usbdev_s *dev, uint8_t epno,
                                         bool in, uint8_t eptype)
{
  struct stm32f0_usbdev_s *priv = (struct stm32f0_usbdev_s *)dev;
  struct stm32f0_ep_s *privep = NULL;
  uint8_t epset = STM32F0_ENDP_ALLSET;
  int bufno;

  usbtrace(TRACE_DEVALLOCEP, (uint16_t)epno);
#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_INVALIDPARMS), 0);
      return NULL;
    }
#endif

  /* Ignore any direction bits in the logical address */

  epno = USB_EPNO(epno);

  /* A logical address of 0 means that any endpoint will do */

  if (epno > 0)
    {
      /* Otherwise, we will return the endpoint structure only for the requested
       * 'logical' endpoint.  All of the other checks will still be performed.
       *
       * First, verify that the logical endpoint is in the range supported by
       * by the hardware.
       */

      if (epno >= STM32F0_NENDPOINTS)
        {
          usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_BADEPNO), (uint16_t)epno);
          return NULL;
        }

      /* Convert the logical address to a physical OUT endpoint address and
       * remove all of the candidate endpoints from the bitset except for the
       * the IN/OUT pair for this logical address.
       */

      epset = STM32F0_ENDP_BIT(epno);
    }

  /* Check if the selected endpoint number is available */

  privep = stm32f0_epreserve(priv, epset);
  if (!privep)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_EPRESERVE), (uint16_t)epset);
      goto errout;
    }

  /* Allocate a PMA buffer for this endpoint */

#warning "REVISIT: Should configure BULK EPs using double buffer feature"
  bufno = stm32f0_epallocpma(priv);
  if (bufno < 0)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_EPBUFFER), 0);
      goto errout_with_ep;
    }

  privep->bufno = (uint8_t)bufno;
  return &privep->ep;

errout_with_ep:
  stm32f0_epunreserve(priv, privep);
errout:
  return NULL;
}

/****************************************************************************
 * Name: stm32f0_freeep
 ****************************************************************************/

static void stm32f0_freeep(struct usbdev_s *dev, struct usbdev_ep_s *ep)
{
  struct stm32f0_usbdev_s *priv;
  struct stm32f0_ep_s *privep;

#ifdef CONFIG_DEBUG_USB
  if (!dev || !ep)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_INVALIDPARMS), 0);
      return;
    }
#endif
  priv   = (struct stm32f0_usbdev_s *)dev;
  privep = (struct stm32f0_ep_s *)ep;
  usbtrace(TRACE_DEVFREEEP, (uint16_t)USB_EPNO(ep->eplog));

  if (priv && privep)
    {
      /* Free the PMA buffer assigned to this endpoint */

      stm32f0_epfreepma(priv, privep);

      /* Mark the endpoint as available */

      stm32f0_epunreserve(priv, privep);
    }
}

/****************************************************************************
 * Name: stm32f0_getframe
 ****************************************************************************/

static int stm32f0_getframe(struct usbdev_s *dev)
{
  uint16_t fnr;

#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Return the last frame number detected by the hardware */

  fnr = stm32f0_getreg(STM32F0_USB_FNR);
  usbtrace(TRACE_DEVGETFRAME, fnr);
  return (fnr & USB_FNR_FN_MASK);
}

/****************************************************************************
 * Name: stm32f0_wakeup
 ****************************************************************************/

static int stm32f0_wakeup(struct usbdev_s *dev)
{
  struct stm32f0_usbdev_s *priv = (struct stm32f0_usbdev_s *)dev;
  irqstate_t flags;

  usbtrace(TRACE_DEVWAKEUP, 0);
#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Start the resume sequence.  The actual resume steps will be driven
   * by the ESOF interrupt.
   */

  flags = enter_critical_section();
  stm32f0_initresume(priv);
  priv->rsmstate = RSMSTATE_STARTED;

  /* Disable the SUSP interrupt (until we are fully resumed), disable
   * the WKUP interrupt (we are already waking up), and enable the
   * ESOF interrupt that will drive the resume operations.  Clear any
   * pending ESOF interrupt.
   */

  stm32f0_setimask(priv, USB_CNTR_ESOFM, USB_CNTR_WKUPM | USB_CNTR_SUSPM);
  stm32f0_putreg(~USB_ISTR_ESOF, STM32F0_USB_ISTR);
  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: stm32f0_selfpowered
 ****************************************************************************/

static int stm32f0_selfpowered(struct usbdev_s *dev, bool selfpowered)
{
  struct stm32f0_usbdev_s *priv = (struct stm32f0_usbdev_s *)dev;

  usbtrace(TRACE_DEVSELFPOWERED, (uint16_t)selfpowered);

#ifdef CONFIG_DEBUG_USB
  if (!dev)
    {
      usbtrace(TRACE_DEVERROR(STM32F0_TRACEERR_INVALIDPARMS), 0);
      return -ENODEV;
    }
#endif

  priv->selfpowered = selfpowered;
  return OK;
}

/****************************************************************************
 * Initialization/Reset
 ****************************************************************************/

/****************************************************************************
 * Name: stm32f0_reset
 ****************************************************************************/

