apache/nuttx/arch/arm/src/stm32f0/stm32f0_usbdev.c
static void stm32f0_reset(struct stm32f0_usbdev_s *priv)
{
  int epno;

  /* Put the USB controller in reset, disable all interrupts */

  stm32f0_putreg(USB_CNTR_FRES, STM32F0_USB_CNTR);

  /* Tell the class driver that we are disconnected.  The class driver
   * should then accept any new configurations.
   */

  CLASS_DISCONNECT(priv->driver, &priv->usbdev);

  /* Reset the device state structure */

  priv->ep0state  = EP0STATE_IDLE;
  priv->rsmstate  = RSMSTATE_IDLE;
  priv->rxpending = false;

  /* Reset endpoints */

  for (epno = 0; epno < STM32F0_NENDPOINTS; epno++)
    {
      struct stm32f0_ep_s *privep = &priv->eplist[epno];

      /* Cancel any queued requests.  Since they are canceled
       * with status -ESHUTDOWN, then will not be requeued
       * until the configuration is reset.  NOTE:  This should
       * not be necessary... the CLASS_DISCONNECT above should
       * result in the class implementation calling stm32f0_epdisable
       * for each of its configured endpoints.
       */

      stm32f0_cancelrequests(privep);

      /* Reset endpoint status */

      privep->stalled   = false;
      privep->halted    = false;
      privep->txbusy    = false;
      privep->txnullpkt = false;
    }

  /* Re-configure the USB controller in its initial, unconnected state */

  stm32f0_hwreset(priv);
  priv->usbdev.speed = USB_SPEED_FULL;
}

/****************************************************************************
 * Name: stm32f0_hwreset
 ****************************************************************************/

static void stm32f0_hwreset(struct stm32f0_usbdev_s *priv)
{
  /* Put the USB controller into reset, clear all interrupt enables */

  stm32f0_putreg(USB_CNTR_FRES, STM32F0_USB_CNTR);

  /* Disable interrupts (and perhaps take the USB controller out of reset) */

  priv->imask = 0;
  stm32f0_putreg(priv->imask, STM32F0_USB_CNTR);

  /* Set the STM32 BTABLE address */

  stm32f0_putreg(STM32F0_BTABLE_ADDRESS & 0xfff8, STM32F0_USB_BTABLE);

  /* Initialize EP0 */

  stm32f0_seteptype(EP0, USB_EPR_EPTYPE_CONTROL);
  stm32f0_seteptxstatus(EP0, USB_EPR_STATTX_NAK);
  stm32f0_seteprxaddr(EP0, STM32F0_EP0_RXADDR);
  stm32f0_seteprxcount(EP0, STM32F0_EP0MAXPACKET);
  stm32f0_seteptxaddr(EP0, STM32F0_EP0_TXADDR);
  stm32f0_clrstatusout(EP0);
  stm32f0_seteprxstatus(EP0, USB_EPR_STATRX_VALID);

  /* Set the device to respond on default address */

  stm32f0_setdevaddr(priv, 0);

  /* Clear any pending interrupts */

  stm32f0_putreg(0, STM32F0_USB_ISTR);

  /* Enable interrupts at the USB controller */

  stm32f0_setimask(priv, STM32F0_CNTR_SETUP, (USB_CNTR_ALLINTS & ~STM32F0_CNTR_SETUP));
  stm32f0_dumpep(EP0);
}

/****************************************************************************
 * Name: stm32f0_hwsetup
 ****************************************************************************/

static void stm32f0_hwsetup(struct stm32f0_usbdev_s *priv)
{
  int epno;

  /* Power the USB controller, put the USB controller into reset, disable
   * all USB interrupts
   */

  stm32f0_putreg(USB_CNTR_FRES | USB_CNTR_PDWN, STM32F0_USB_CNTR);

  /* Disconnect the device / disable the pull-up.  We don't want the
   * host to enumerate us until the class driver is registered.
   */

  stm32f0_usbpullup(&priv->usbdev, false);

  /* Initialize the device state structure.  NOTE: many fields
   * have the initial value of zero and, hence, are not explicitly
   * initialized here.
   */

  memset(priv, 0, sizeof(struct stm32f0_usbdev_s));
  priv->usbdev.ops   = &g_devops;
  priv->usbdev.ep0   = &priv->eplist[EP0].ep;
  priv->epavail      = STM32F0_ENDP_ALLSET & ~STM32F0_ENDP_BIT(EP0);
  priv->bufavail     = STM32F0_BUFFER_ALLSET & ~STM32F0_BUFFER_EP0;

  /* Initialize the endpoint list */

  for (epno = 0; epno < STM32F0_NENDPOINTS; epno++)
    {
      /* Set endpoint operations, reference to driver structure (not
       * really necessary because there is only one controller), and
       * the (physical) endpoint number which is just the index to the
       * endpoint.
       */

      priv->eplist[epno].ep.ops    = &g_epops;
      priv->eplist[epno].dev       = priv;
      priv->eplist[epno].ep.eplog  = epno;

      /* We will use a fixed maxpacket size for all endpoints (perhaps
       * ISOC endpoints could have larger maxpacket???).  A smaller
       * packet size can be selected when the endpoint is configured.
       */

      priv->eplist[epno].ep.maxpacket = STM32F0_MAXPACKET_SIZE;
    }

  /* Select a smaller endpoint size for EP0 */

#if STM32F0_EP0MAXPACKET < STM32F0_MAXPACKET_SIZE
  priv->eplist[EP0].ep.maxpacket = STM32F0_EP0MAXPACKET;
#endif

  /* Configure the USB controller.  USB uses the following GPIO pins:
   *
   *   PA9  - VBUS
   *   PA10 - ID
   *   PA11 - DM
   *   PA12 - DP
   *
   * "As soon as the USB is enabled, these pins [DM and DP] are connected to
   * the USB internal transceiver automatically."
   */

  /* Power up the USB controller, holding it in reset.  There is a delay of
   * about 1uS after applying power before the USB will behave predictably.
   * A 5MS delay is more than enough.  NOTE that we leave the USB controller
   * in the reset state; the hardware will not be initialized until the
   * class driver has been bound.
   */

  stm32f0_putreg(USB_CNTR_FRES, STM32F0_USB_CNTR);
  up_mdelay(5);
}

/****************************************************************************
 * Name: stm32f0_hwshutdown
 ****************************************************************************/

static void stm32f0_hwshutdown(struct stm32f0_usbdev_s *priv)
{
  priv->usbdev.speed = USB_SPEED_UNKNOWN;

  /* Disable all interrupts and force the USB controller into reset */

  stm32f0_putreg(USB_CNTR_FRES, STM32F0_USB_CNTR);

  /* Clear any pending interrupts */

  stm32f0_putreg(0, STM32F0_USB_ISTR);

  /* Disconnect the device / disable the pull-up */

  stm32f0_usbpullup(&priv->usbdev, false);

  /* Power down the USB controller */

  stm32f0_putreg(USB_CNTR_FRES | USB_CNTR_PDWN, STM32F0_USB_CNTR);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_usbinitialize
 * Description:
 *   Initialize the USB driver
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

